[
  {
    "id": "SEC-001",
    "title": "Hardcoded API Keys with Admin Privileges",
    "severity": "Critical",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/auth.ts"],
    "sink": "auth",
    "description": "Development API key 'dev-api-key-12345' is hardcoded in auth middleware with admin privileges. This key grants full access to all protected endpoints.",
    "impact": "Complete authentication bypass. Attacker with knowledge of this key can perform any admin action including minting tokens, modifying oracle data, and accessing treasury.",
    "recommendation": "Remove all hardcoded API keys. Implement proper key management using database storage with bcrypt hashing for API key validation.",
    "fix_strategy": "1. Remove hardcoded keys from source code. 2. Create API key table in database. 3. Store hashed keys using bcrypt. 4. Validate keys against database on each request.",
    "tests_to_add": ["auth.hardcoded-keys.test.ts"],
    "references": ["OWASP ASVS 2.10.4", "CWE-798"]
  },
  {
    "id": "SEC-002",
    "title": "JWT Secret Weak Default Value",
    "severity": "Critical",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/auth.ts", "assets/.env.example"],
    "sink": "crypto",
    "description": "JWT secret defaults to 'development-secret' when JWT_SECRET environment variable is not set. The .env.example file contains a weak placeholder that could be used in production.",
    "impact": "Token forgery allowing authentication bypass. Attacker can create valid JWTs for any user including admin accounts.",
    "recommendation": "Require JWT_SECRET environment variable at startup. Validate minimum entropy (256 bits). Never use default values.",
    "fix_strategy": "1. Add startup validation requiring JWT_SECRET. 2. Validate secret length >= 32 characters. 3. Remove default fallback value. 4. Update .env.example with clear instructions.",
    "tests_to_add": ["auth.jwt-secret-validation.test.ts"],
    "references": ["OWASP ASVS 3.5.3", "CWE-321"]
  },
  {
    "id": "SEC-003",
    "title": "Missing Nonce Protection for Signature Authentication",
    "severity": "Critical",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/auth.ts"],
    "sink": "auth",
    "description": "Ethereum signature authentication only uses timestamp validation with 5-minute window. No nonce tracking prevents message replay within this window.",
    "impact": "Signature replay attack. Attacker who captures a valid signed message can replay it multiple times within the 5-minute window.",
    "recommendation": "Implement server-generated nonces stored in Redis. Each nonce should be single-use and invalidated after verification.",
    "fix_strategy": "1. Add /auth/nonce endpoint returning server-generated nonce. 2. Store nonces in Redis with 5-minute TTL. 3. Include nonce in signed message. 4. Validate and invalidate nonce on use.",
    "tests_to_add": ["auth.nonce-replay.test.ts"],
    "references": ["OWASP ASVS 2.9.1", "CWE-294", "SWC-121"]
  },
  {
    "id": "SEC-004",
    "title": "Unsigned Transactions Accepted for Broadcast",
    "severity": "Critical",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/routes/mint.ts"],
    "sink": "web3",
    "description": "The mint execute endpoint accepts unsigned transaction data and broadcasts it directly. No verification that the transaction was properly signed by authorized signer.",
    "impact": "Arbitrary transaction broadcast. Attacker can submit malicious transactions that the API will broadcast to the network.",
    "recommendation": "Require signed transaction data. Verify signature matches authorized signer before broadcast. Validate transaction parameters match request.",
    "fix_strategy": "1. Accept only signed transaction hex. 2. Decode and verify signature. 3. Validate signer is authorized for the operation. 4. Validate transaction parameters match API request.",
    "tests_to_add": ["mint.transaction-validation.test.ts"],
    "references": ["OWASP ASVS 10.2.1", "CWE-345", "SWC-115"]
  },
  {
    "id": "SEC-005",
    "title": "Private Key Patterns in Example Configuration",
    "severity": "Critical",
    "confidence": "High",
    "component": "infra",
    "file_paths": ["assets/.env.example", "assets/config/.env.example"],
    "sink": "crypto",
    "description": "Example environment files contain private key variable patterns that could be confused with real keys or copied directly into production.",
    "impact": "Credential exposure in version control. Developers may accidentally commit real keys or use example values in production.",
    "recommendation": "Use clearly fake placeholder values that cannot be valid keys. Add git hooks to prevent committing real key patterns.",
    "fix_strategy": "1. Replace key examples with 'YOUR_PRIVATE_KEY_HERE'. 2. Add pre-commit hook checking for hex key patterns. 3. Add .gitignore for .env files. 4. Document secure key management.",
    "tests_to_add": ["ci.secrets-detection.test.ts"],
    "references": ["OWASP ASVS 1.6.2", "CWE-798"]
  },
  {
    "id": "SEC-006",
    "title": "Security Analysis Tools Non-Blocking in CI",
    "severity": "High",
    "confidence": "High",
    "component": "infra",
    "file_paths": ["assets/.github/workflows/security.yml"],
    "sink": "auth",
    "description": "Slither, Mythril, and npm audit are configured with continue-on-error: true, allowing vulnerable code to be merged even when security tools detect issues.",
    "impact": "Known vulnerabilities merged to main branch. Security tools become advisory-only instead of enforcement gates.",
    "recommendation": "Remove continue-on-error from security-critical steps. Configure failure thresholds for acceptable risk levels.",
    "fix_strategy": "1. Remove continue-on-error from Slither, Mythril steps. 2. Configure npm audit to fail on high/critical. 3. Add summary step that fails if any security check failed. 4. Upload artifacts before failing.",
    "tests_to_add": [],
    "references": ["OWASP ASVS 14.2.2", "CWE-693"]
  },
  {
    "id": "SEC-007",
    "title": "GraphQL Introspection Enabled in Production",
    "severity": "High",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/server.ts"],
    "sink": "web3",
    "description": "GraphQL introspection is enabled regardless of environment, allowing attackers to discover the complete API schema.",
    "impact": "Schema disclosure enables targeted attacks. Attackers can identify all queries, mutations, and types to plan exploitation.",
    "recommendation": "Disable introspection in production. Only enable for development environments.",
    "fix_strategy": "1. Check NODE_ENV before enabling introspection. 2. Disable introspection when NODE_ENV === 'production'. 3. Consider disabling in staging as well.",
    "tests_to_add": ["server.introspection.test.ts"],
    "references": ["OWASP ASVS 4.2.1", "CWE-200"]
  },
  {
    "id": "SEC-008",
    "title": "Rate Limiting Not Per-User",
    "severity": "High",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/cache.ts"],
    "sink": "auth",
    "description": "Rate limiting is applied globally (100 requests/minute) rather than per-user or per-address. A single malicious user can exhaust the limit for all users.",
    "impact": "Denial of service. Single attacker can prevent legitimate users from accessing the API.",
    "recommendation": "Implement tiered rate limiting: per-IP, per-API-key, and per-wallet-address with different limits.",
    "fix_strategy": "1. Add per-IP rate limiting (stricter for unauthenticated). 2. Add per-API-key limits. 3. Add per-wallet-address limits for Web3 operations. 4. Keep global limit as safety net.",
    "tests_to_add": ["cache.rate-limiting.test.ts"],
    "references": ["OWASP ASVS 11.1.4", "CWE-770"]
  },
  {
    "id": "SEC-009",
    "title": "Redis Connection Without TLS",
    "severity": "High",
    "confidence": "Medium",
    "component": "infra",
    "file_paths": ["assets/api-gateway/src/middleware/cache.ts"],
    "sink": "crypto",
    "description": "Redis connection is established without TLS encryption. Cache data including session tokens and rate limit state transmitted in plaintext.",
    "impact": "Data interception on network. Attacker with network access can read cached session data and tokens.",
    "recommendation": "Enable TLS for Redis connections. Use REDIS_TLS environment variable to configure.",
    "fix_strategy": "1. Add REDIS_TLS environment variable check. 2. Configure ioredis with TLS options when enabled. 3. Update documentation for TLS setup. 4. Require TLS in production environments.",
    "tests_to_add": ["cache.tls-connection.test.ts"],
    "references": ["OWASP ASVS 9.1.1", "CWE-319"]
  },
  {
    "id": "SEC-010",
    "title": "JSON.parse Without Schema Validation",
    "severity": "High",
    "confidence": "High",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/auth.ts"],
    "sink": "deserialize",
    "description": "User-provided Base64 messages are decoded and parsed with JSON.parse without schema validation, allowing malformed data injection.",
    "impact": "Malformed message processing. Attacker can inject unexpected fields or types causing undefined behavior.",
    "recommendation": "Use Zod schema validation for all parsed user input. Define strict schemas for expected message formats.",
    "fix_strategy": "1. Define Zod schema for signed message format. 2. Parse and validate in single step using safeParse. 3. Return 400 error for validation failures. 4. Log validation errors for monitoring.",
    "tests_to_add": ["auth.message-validation.test.ts"],
    "references": ["OWASP ASVS 5.1.3", "CWE-502"]
  },
  {
    "id": "SEC-011",
    "title": "User Input in Logs Without Sanitization",
    "severity": "Medium",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/routes/mint.ts", "assets/api-gateway/src/middleware/auth.ts"],
    "sink": "template",
    "description": "User-provided data such as addresses and request parameters are logged without sanitization, enabling log injection attacks.",
    "impact": "Log tampering and injection. Attacker can inject fake log entries or newlines to hide malicious activity.",
    "recommendation": "Sanitize all user input before logging. Replace newlines and special characters. Use structured logging format.",
    "fix_strategy": "1. Create sanitizeForLog() utility function. 2. Apply to all user input before logging. 3. Use JSON structured logging. 4. Add log integrity monitoring.",
    "tests_to_add": ["logging.sanitization.test.ts"],
    "references": ["OWASP ASVS 7.1.1", "CWE-117"]
  },
  {
    "id": "SEC-012",
    "title": "Missing Object-Level Authorization Checks",
    "severity": "Medium",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/routes/mint.ts"],
    "sink": "auth",
    "description": "Some endpoints allow querying data without verifying the requester owns or is authorized to access the specific resource.",
    "impact": "Unauthorized data access. Users may access other users' mint history or transaction details.",
    "recommendation": "Add ownership verification for all resource-specific endpoints. Validate requesting user has access to requested resource.",
    "fix_strategy": "1. Add ownership check middleware. 2. Verify requester address matches resource owner. 3. Allow admin bypass with audit logging. 4. Return 403 for unauthorized access.",
    "tests_to_add": ["auth.idor.test.ts"],
    "references": ["OWASP ASVS 4.1.2", "CWE-639"]
  },
  {
    "id": "SEC-013",
    "title": "Single Oracle Dependency Without Fallback",
    "severity": "Medium",
    "confidence": "High",
    "component": "contract",
    "file_paths": ["assets/contracts/BackingOraclePoR.sol"],
    "sink": "web3",
    "description": "The protocol relies on a single Chainlink oracle feed without fallback mechanism. Oracle failure causes complete protocol halt.",
    "impact": "Protocol unavailability. If Chainlink feed fails or is manipulated, minting and redemptions cannot occur.",
    "recommendation": "Implement multi-oracle aggregation with fallback logic. Use median of multiple sources with outlier detection.",
    "fix_strategy": "1. Add secondary oracle source (Band Protocol or custom). 2. Implement median aggregation logic. 3. Add circuit breaker for extreme deviations. 4. Document oracle failure procedures.",
    "tests_to_add": ["oracle.fallback.test.ts"],
    "references": ["SWC-120", "SEAL-001"]
  },
  {
    "id": "SEC-014",
    "title": "Missing EIP-712 Domain Separator Validation",
    "severity": "Medium",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/auth.ts"],
    "sink": "crypto",
    "description": "Signature verification uses ethers.verifyMessage without EIP-712 typed data signing, missing domain separation.",
    "impact": "Cross-application signature replay. Signatures valid for SecureMint could be replayed on other applications using the same message format.",
    "recommendation": "Migrate to EIP-712 typed data signing with proper domain separator including contract address, chain ID, and application name.",
    "fix_strategy": "1. Define EIP-712 domain separator. 2. Create typed data schema for authentication. 3. Update frontend signing to use signTypedData. 4. Verify domain separator in backend.",
    "tests_to_add": ["auth.eip712.test.ts"],
    "references": ["OWASP ASVS 2.9.1", "SWC-117"]
  },
  {
    "id": "SEC-015",
    "title": "Lock Expiration Without Contention Handling",
    "severity": "Medium",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/cache.ts"],
    "sink": "auth",
    "description": "Distributed locks have 10-second TTL without handling for lock expiration during long operations. Could cause double-execution.",
    "impact": "Race condition in critical operations. Two requests could execute the same operation if first lock expires.",
    "recommendation": "Implement lock extension mechanism. Add idempotency keys for critical operations. Handle lock-lost scenarios gracefully.",
    "fix_strategy": "1. Implement lock heartbeat extension. 2. Add idempotency key tracking. 3. Detect lock-lost condition and abort. 4. Log lock contention events.",
    "tests_to_add": ["cache.lock-contention.test.ts"],
    "references": ["CWE-362", "CWE-367"]
  },
  {
    "id": "SEC-016",
    "title": "IP-Based Rate Limiting via X-Forwarded-For",
    "severity": "Medium",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/middleware/cache.ts"],
    "sink": "auth",
    "description": "Rate limiting trusts X-Forwarded-For header without validating proxy chain. Attacker can spoof IP to bypass limits.",
    "impact": "Rate limit bypass. Attacker can rotate spoofed IPs to evade per-IP rate limiting.",
    "recommendation": "Configure trusted proxy list. Only accept X-Forwarded-For from known load balancers. Fall back to socket IP for untrusted sources.",
    "fix_strategy": "1. Define TRUSTED_PROXIES environment variable. 2. Validate proxy chain before trusting header. 3. Use leftmost untrusted IP. 4. Log suspicious header patterns.",
    "tests_to_add": ["cache.ip-spoofing.test.ts"],
    "references": ["OWASP ASVS 11.1.7", "CWE-290"]
  },
  {
    "id": "SEC-017",
    "title": "Database Credentials in Connection String",
    "severity": "Medium",
    "confidence": "High",
    "component": "infra",
    "file_paths": ["assets/.env.example"],
    "sink": "auth",
    "description": "Database connection string includes plaintext password. Connection strings often end up in logs, error messages, or monitoring.",
    "impact": "Credential exposure in logs/monitoring. Database password visible in error stack traces.",
    "recommendation": "Use separate environment variables for database credentials. Configure Prisma to use individual variables. Enable SSL for database connection.",
    "fix_strategy": "1. Use DB_HOST, DB_PORT, DB_USER, DB_PASSWORD, DB_NAME separately. 2. Construct connection string at runtime. 3. Add SSL/TLS requirement. 4. Redact credentials in error handling.",
    "tests_to_add": [],
    "references": ["OWASP ASVS 2.10.2", "CWE-522"]
  },
  {
    "id": "SEC-018",
    "title": "CORS Configuration via Environment Variable",
    "severity": "Low",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/server.ts"],
    "sink": "web3",
    "description": "CORS allowed origins configured via CORS_ORIGINS environment variable. Misconfiguration could allow requests from malicious origins.",
    "impact": "Cross-origin attacks if misconfigured. Malicious site could make authenticated requests on behalf of users.",
    "recommendation": "Validate CORS origins against allowlist. Default to most restrictive setting. Log CORS violations.",
    "fix_strategy": "1. Define explicit origin allowlist. 2. Validate configuration at startup. 3. Reject wildcard (*) in production. 4. Log and alert on CORS violations.",
    "tests_to_add": ["server.cors.test.ts"],
    "references": ["OWASP ASVS 14.5.3", "CWE-942"]
  },
  {
    "id": "SEC-019",
    "title": "Missing Request Timeout Configuration",
    "severity": "Low",
    "confidence": "Medium",
    "component": "api",
    "file_paths": ["assets/api-gateway/src/server.ts"],
    "sink": "auth",
    "description": "No explicit request timeout configuration. Long-running requests could exhaust server resources.",
    "impact": "Resource exhaustion. Slowloris-style attacks could consume all available connections.",
    "recommendation": "Configure request timeout at server level. Add per-endpoint timeout for expensive operations.",
    "fix_strategy": "1. Set server.timeout to 30 seconds default. 2. Add per-route timeout middleware. 3. Configure keep-alive timeout. 4. Monitor for timeout events.",
    "tests_to_add": ["server.timeout.test.ts"],
    "references": ["OWASP ASVS 11.1.2", "CWE-400"]
  },
  {
    "id": "SEC-020",
    "title": "Kubernetes Secrets Not Encrypted at Rest",
    "severity": "Low",
    "confidence": "Medium",
    "component": "infra",
    "file_paths": ["assets/infrastructure/kubernetes/secrets.yaml"],
    "sink": "crypto",
    "description": "Kubernetes secrets stored as base64-encoded (not encrypted). External Secrets Operator recommended but not implemented.",
    "impact": "Credential exposure if etcd compromised. Secrets visible to anyone with cluster access.",
    "recommendation": "Implement External Secrets Operator with HashiCorp Vault or AWS Secrets Manager. Enable etcd encryption at rest.",
    "fix_strategy": "1. Deploy External Secrets Operator. 2. Migrate secrets to external provider. 3. Enable Kubernetes etcd encryption. 4. Implement secret rotation.",
    "tests_to_add": [],
    "references": ["OWASP ASVS 6.4.1", "CWE-312"]
  },
  {
    "id": "SEC-021",
    "title": "No Code Coverage Minimum Enforcement",
    "severity": "Low",
    "confidence": "High",
    "component": "infra",
    "file_paths": ["assets/.github/workflows/ci.yml"],
    "sink": "auth",
    "description": "Code coverage is collected but no minimum threshold enforced. Coverage could decline without notice.",
    "impact": "Untested code paths. Security-critical code may lack test coverage.",
    "recommendation": "Enforce minimum 80% code coverage. Add coverage badge to README. Block PRs that decrease coverage.",
    "fix_strategy": "1. Add coverage threshold in jest/vitest config. 2. Fail CI if coverage below threshold. 3. Add coverage report to PR comments. 4. Track coverage trends.",
    "tests_to_add": [],
    "references": ["OWASP ASVS 14.2.4", "CWE-754"]
  }
]
